# Найдите разницу между максимальным и минимальным элементом (диапазон).
base_list = [5, -12, 8, 0, 3, -7, 15, 2, -4, 10]
r1= max(base_list) - min(base_list)
print(r1)